/* function นี้ทำงานอย่างไรน้องไม่จำเป็นต้องสนใจงับ ขอแค่รู้ว่าเรียกฟังชันก์ Info() จะมีการคืนค่าที่เป็น promise มาให้เรา */
function Info() {
    return Promise.resolve("Success Access")
}

/* ลองดูผลลัพธ์จะเห็นว่า ได่ค่า promise แล้วมีค่าบางอย่างอยู่ข้างใน promise */
console.log(Info("res"))

/* ทีนี้เราจะนำค่านั้นออกมายังไง สำหรับ promise จะมี เมธอด ที่ไว้จัดการกับ promise คือ เมธอด then */

/* สังเกตุว่าจะได้ผลลัพธ์ออกมาแล้ว */
Info().then(result => console.log(result))


/* 

อย่างที่พี่บอกไป promise นั้นจะมีสถานะที่ทำงานสำเร็จและล้มเหลว ในตัวอย่างด้านบนคือทำงานสำเร็จ
ตัวอย่างที่ทำงานล้มเหลวให้น้องดูอีก exercise ต่อไป

*/



