/* 
[INTRODUCTION]
สวัสดีครับ ยินดีต้อนรับเข้าสู่แบบฝึกหัดการเขียน JavaScript ที่คาเฟ่ที่สุดนะครับ
ข้อความส่วนใน Comment นี้ได้เขียนหลังจากนั่งทำแบบฝึกหัดตัวนี้จนเสร็จ จะเวลาก็ประมาณ 4-5 วันได้

แบบฝึกหัดชุดนี้ถือเป็นแนวใหม่ๆ ที่พี่ได้ลองทำเหมือนกัน โดยได้แนวทางมาจากอาจารย์ JTF
รูปแบบจะเป็น เน้นให้ลองทำความเข้าใจตัวโค้ดจากการใช้งานจริง จากนั้นจึงมาลองทำแบบฝึกหัดง่ายๆ
เพื่อที่จะทำให้มือใหม่สามารถเข้าใจได้อย่างง่าย

สำหรับส่วนที่ 1 นี้ เราจะให้น้องได้ฝึกลองฝึกเขียน Syntax สำหรับภาษา JavaScript ให้คล่องก่อน
ที่ลองไปใช้จริงในการเขียนเว็บคู่กับตัว HTML/CSS เชื่อว่าน้องๆหลายคนตอนนี้อาจจะสงสัยว่า เอ้อ แล้วมันจะ
ไปเชื่อมกับไอ 2 อย่างที่พึ่งเรียนมาได้ไง ซึ่งเราจะอธิบายต่อไปบทถัดๆ ไปครับ

ส่วนถ้าน้องคนไหนรู้สึกว่าตัวเองพอเขียนเป็นแล้ว จะข้ามตรงนี้ไปก็ได้นะครับ 555555

ในแต่ละข้อพี่อาจจะทิ้งคำถามชวนคิดไว้สักหน่อย ซึ่งไม่ได้จะต้องส่งแต่อย่างใด 
เพียงแต่ให้น้องลองตอบตัวเองดูเพื่อทบทวนความเข้าใจไปพร้อมๆ กันนะครับ

- KanonKC
*/

console.log("Let's start!")