/*

[EXERCISE]
ลองสร้าง Array ต่อไปนี้ โดยใช้ Spread Operator ช่วย เพื่อให้สามารถสร้าง Array ได้ภายในบรรทัดเดียว
---!!! ในแต่ละข้อจะกำหนดว่าจะให้เขียนค่าใน Array ได้มากที่สุดกี่ตัว พยายามอย่าให้เขียนเกิน !!!---

เช่น 
[...array,6] นับเป็น 2 ตัว (คือมี ...array กับ 6)
[7,...array,6] นับเป็น 3 ตัว (คือมี 7, ...array และ 6)
*/

// ใช้ตัวแปรนี้เพื่อช่วยสร้าง Array ข้างล่าง
const array = [1,2,3,4,5]

/*
[ 1, 2, 3, 4, 5, 6 ]
ให้เขียนได้ไม่เกิน 2 ตัว
*/
console.log([...array,6])

/*
[ 900, 1, 2, 3, 4, 5 ]
ให้เขียนได้ไม่เกิน 2 ตัว
*/
console.log([900,...array])

/*
[
  10, 20, 30,  1, 2,
   3,  4,  5, 50
]
ให้เขียนได้ไม่เกิน 5 ตัว
*/
console.log([10,20,30,...array,50])

/*
[ 1, 2, 3, 4 ]
ให้เขียนได้ไม่เกิน 2 ตัว
[HINT] slice
*/
console.log([...array.slice(0,4)])

/*
[ 1, 2, 4, 5 ]
ให้เขียนได้ไม่เกิน 2 ตัว
[HINT] ใน 1 กล่อง Array จะมี Spread Operator หลายอันก็ได้
*/
console.log([...array.slice(0,2),...array.slice(3)])
