/*
ในหัวข้อนี้เราจะมาลองแกะข้อมูลภายใน Array/Object กันแล้วเอามายัดใส่ตัวแปรตรงๆ
โอเคอาจจะงงที่เขียนไปข้างบน แต่เดี๋ยวลองดูตัวอย่างแล้วอาจจะพอเข้าใจขึ้นก็ได้

โดยเราจะขอยกตัวอย่างจาก Array ก่อน
*/

const arr = ['A','B','C','D','E']

let [x] = arr
console.log(x)
// คิดว่า x แทนค่าอะไรในตัวแปร arr

let [y,z] = arr
console.log(y,z)
// คิดว่า y,z แทนค่าอะไรในตัวแปร arr

// คิดว่าถ้าเปลี่ยนตัวแปร x,y,z จากที่ผ่านมาเป็นตัวแปรอื่น จะยังได้ค่าเดิมอยู่ไหม

/*
ดูตรงนี้อาจจะรู้สึกว่าไม่มีประโยชน์ จิ้ม index เอาแบบปกติน่าจะง่ายกว่า
จริงๆแล้ว การทำ Destructing ใน Array ก็ไม่ค่อยนิยมมาใช้ขนาดนั้นหรอกครับ
ัอันนี้เองก็เป็นเพียงการยกตัวอย่าง เพื่อที่จะได้ทำความเข้าใจการแกะข้อมูลใน Object ในบทถัดไปครับ
*/